# 행 기준 병합

In [3]:
from pandas import DataFrame
from pandas import concat

In [4]:
df1 = DataFrame({'이름': ['영희', '철수'], '국어': [87, 91]})
print(df1)

df2 = DataFrame({'이름': ['민철', '수현'], '국어': [78, 92]})
print(df2)

   이름  국어
0  영희  87
1  철수  91
   이름  국어
0  민철  78
1  수현  92

### concat() 함수 기본 사용 방법

In [5]:
# 병합하기

concat([df1, df2])

   이름  국어
0  영희  87
1  철수  91
0  민철  78
1  수현  92

In [6]:
# 병합된 결과에서 index 재구성

인덱스_재구성df = concat([df1, df2])
인덱스_재구성df.reset_index(inplace =True, drop =True)
인덱스_재구성df

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

In [8]:
# 병합 후 ignore_index =True 사용하여 인덱스 재구성

concat([df1, df2], ignore_index = True)

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

### 서로 다른 변수를 갖는 데이터 프레임 병합

In [12]:
df3 = DataFrame({'이름': ['영희', '철수'], '국어': [87, 91]})
print(df3)
print(df3.info())
df4 = DataFrame({'이름': ['민철', '수현'], '수학': [78, 92]})
print(df4)

   이름  국어
0  영희  87
1  철수  91
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      2 non-null      object
 1   국어      2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes
None
   이름  수학
0  민철  78
1  수현  92

In [13]:
# 데이터 병합
concat([df3,df4], ignore_index = True)

   이름    국어    수학
0  영희  87.0   NaN
1  철수  91.0   NaN
2  민철   NaN  78.0
3  수현   NaN  92.0

### 인덱스를 갖는 데이터 프레임 병합

In [15]:
df5 = DataFrame({'국어': [87, 91, 85]},
                index = ['영희','철수','민수'])
print(df5)

df6 = DataFrame({'국어': [78, 92, 82]},
                index = ['민철','수현','민수'])
print(df6)

    국어
영희  87
철수  91
민수  85
    국어
민철  78
수현  92
민수  82

In [16]:
# 데이터 병합 진행하면, 인덱스도 함께 병합
# 증복되는 인덱스 존재할 경우, 각 행은 개별적 존재(인덱스는 중복된 채로)

concat([df5,df6])

    국어
영희  87
철수  91
민수  85
민철  78
수현  92
민수  82

In [ ]:
# 인덱스 제외하고 병합하기
# 정확도가 떨어진다
concat([df5, df6], ignore_index =True)

   국어
0  87
1  91
2  85
3  78
4  92
5  82

### 연습문제

In [45]:
from hossam import load_data
from pandas import merge

In [24]:
df1 = load_data('shop_강남')
print(df1)
print(df1.info())
df2 = load_data('shop_종로')
print(df2)

[data] https://data.hossam.kr/data/lab04/shop_강남.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata
  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   OrderID   4 non-null      object
 1   Product   4 non-null      object
 2   Quantity  4 non-null      int64
 3   Price     3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 260.0+ bytes
None
[data] https://data.hossam.kr/data/lab04/shop_종로.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata
  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard       999  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [ ]:
df1['Price'] = df1['Price'].astype('float')
print(df1)

# df1['Price'] = df1['Price'].fillna(8000) 결측값이 하나이므로 이렇게 해도 된다

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [50]:
복사 = df1.copy()
print(복사)

복사.iloc[1, 3] = 8000
복사

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [ ]:
복사_2 = df2.copy()
print(복사_2)

복사_2.iloc[1, 2] = 9
복사_2

# 복사_2['Quantity'] = 복사_2['Quantity].replace(999,9)

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard       999  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [52]:
final = concat([복사, 복사_2])
final.reset_index(inplace = True, drop = True)
final

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0
4    B001     Mouse        15   8000.0
5    B002  Keyboard         9  14500.0
6    B003    Webcam        10  30000.0
7    B004     Mouse        18   8000.0